[{
  "id": "Slow cooker spicy chicken and bean soup ",
  "description": "This is a Mexican inspired taco-style soup. Chilli beans are slowly cooked with sweetcorn, black beans and chicken in a seasoned tomato base. Serve with a dollop of soured cream, grated Cheddar cheese and crushed tortilla chips. ",
  "prep_time": "Prep: 15 min |Cook: 7 hours ",
  "preparaion_steps": [
    "Place the onion, chilli beans, black beans, sweetcorn, passata, beer and chopped tomatoes in a slow cooker. Add taco seasoning and stir to blend. Lay chicken breasts on top of the mixture, pressing down slightly until just covered by the other ingredients. Set slow cooker for low heat, cover and cook for 5 hours.",
    "Remove chicken breasts from the soup and allow to cool long enough to be handled. Shred the chicken with two forks. Stir the shredded chicken back into the soup and continue cooking for 2 hours. Serve topped with grated Cheddar cheese, a dollop of soured cream and crushed tortilla chips, if desired."
  ],
  "ingredients": [
    "1 onion, chopped",
    "450g tinned chilli beans",
    "1 (410g) tin black beans",
    "1 1/4 (340g) tins sweetcorn kernels, drained",
    "225g passata",
    "350ml beer",
    "1 1/2 (400g) tins chopped tomatoes with chilli, undrained",
    "1 (30g) packet taco seasoning",
    "3 whole skinless, boneless chicken breasts",
    "grated Cheddar cheese (optional)",
    "soured cream (optional)",
    "crushed tortilla chips (optional)"
  ]
},
{
  "id": "slow cooker beef stew",
  "description": "Moist and juicy beef stew made in a slow cooker with carrots, onion and potatoes. ",
  "prep_time": "Prep: 20 min |Cook: 9 hours ",
  "preparaion_steps": [
    "Take the beef and season with salt and pepper to taste. Brown on all sides in a large frying pan over high heat.",
    "Place in the slow cooker and add the soup mix, water, carrots, onion, potatoes and celery.",
    "Cover and cook on low setting for 8 to 10 hours."
  ],
  "ingredients": [
    "1.8kg beef stewing steak",
    "salt and pepper to taste",
    "1 sachet dried French onion soup mix",
    "240ml water",
    "3 carrots, chopped",
    "1 onion, chopped",
    "3 potatoes, peeled and cubed",
    "1 stalk celery, chopped"
  ]
},
{
  "id": "Smoked paprika goulash for the slow cooker ",
  "description": "This is a very rich and flavourful slow cooker stew with a thick, red, smoky tasting sauce. Great for making a day ahead and reheating. Instead of pasta, you can serve over rice or potatoes. ",
  "prep_time": "Prep: 40 min |Cook: 5 hours ",
  "preparaion_steps": [
    "Heat 1 tablespoon oil in a large frying pan over medium-high heat. Cook and stir onions until they soften and begin to brown at the edges, 8 to 10 minutes. Add the garlic and cook for one minute. Transfer mixture to a slow cooker. Cover and set cooker to Low.",
    "Mix together paprika, salt and pepper in a large bowl. Toss the meat cubes in the paprika mixture until evenly coated.",
    "Heat one tablespoon of the oil in the same pan over medium-high heat. Put 1/3 of the beef cubes into the pan and cook until nicely browned on all sides. Transfer to the slow cooker. Pour 2 tablespoons of water into the pan and scrape the browned bits from the pan; pour liquid into the slow cooker. This prevents the paprika from burning when you brown the next batches of beef. Add another tablespoon of oil to the pan and cook the next batch the same way; repeat for the third batch.",
    "Stir the tomato puree and the rest of the water into the slow cooker; cover. Cook on High for 4 to 5 hours (or on Low for 6 to 9 hours).",
    "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the egg pasta, and cook uncovered, stirring occasionally, until the noodles have cooked through, but are still firm to the bite, about 5 minutes. Drain.",
    "Serve goulash over pasta with a dollop of soured cream and a sprig of parsley."
  ],
  "ingredients": [
    "1 tablespoon vegetable oil",
    "3 onions, sliced",
    "3 cloves garlic, chopped",
    "4 tablespoons smoked Hungarian paprika",
    "2 teaspoons sea salt",
    "1 teaspoon coarsely ground black pepper",
    "1.25kg lean beef stewing steak, cubed",
    "3 tablespoons vegetable oil, divided",
    "375ml water",
    "175g tomato puree",
    "350g egg pasta",
    "125ml soured cream (optional)",
    "8 sprigs fresh parsley (optional)"
  ]
},
{
  "id": "Pistachio chicken with pomegranate sauce ",
  "description": "This is an elegant dinner for company, and not hard to do at all. Add wild rice and some green vegetables with this for a completely wonderful meal. ",
  "prep_time": "Prep: 10 min |Cook: 20 min ",
  "preparaion_steps": [
    "Preheat the oven to 180 C / Gas mark 4.",
    "Beat together the eggs and the milk. Dredge the chicken breasts in flour, then in egg wash and finally in the chopped pistachios.",
    "In a large frying pan, melt butter over medium heat. Fry the chicken until lightly browned. Place in an earthenware baking dish.",
    "Bake for 30 minutes.",
    "After 20 minutes, melt butter in a saucepan. Fry shallots until soft. Add cream, white wine, chicken stock and pomegranate juice. Simmer for a few minutes.",
    "Place chicken on plates, and pour over sauce."
  ],
  "ingredients": [
    "6 eggs",
    "50ml milk",
    "4 skinless, boneless chicken breast fillets",
    "90g plain flour",
    "130g finely chopped pistachio nuts",
    "For the sauce:",
    "2 tbsp minced shallots",
    "120ml dry white wine",
    "120ml chicken stock",
    "120ml double cream",
    "50g butter",
    "1 ½ tablespoons 100% pomegranate juice"
  ]
},
{
  "id": "Cheesy leek and mustard soup ",
  "description": "A gorgeously creamy leek soup with a sharp cheese and mustard kick. It makes a delicious lunch served with cheese and onion bread or walnut bread. Plus, it's vegetarian too! ",
  "prep_time": "Prep: 15 min |Cook: 1 hour ",
  "preparaion_steps": [
    "In a large pot over medium heat, saute the leeks, onion, potato and carrot in the butter and olive oil for 10 minutes, or until all vegetables are tender.",
    "Mix the mustard powder and cornflour with 100ml water to make a thin paste. Set aside.",
    "Season the vegetable mixture with salt and pepper and sugar. Stir in the mustard-water mixture and the remaining water. Bring mixture to the boil. Stir in the stock cube, reduce heat and simmer for about one hour, until reduced by half.",
    "Using a hand blender or food processor, puree mixture until frothy but not completely smooth.",
    "Return this to the pot and bring to the boil. Stir in the cream, Gruyere and Cheddar cheeses. Heat until cheeses melt, do not boil. Serve hot."
  ],
  "ingredients": [
    "675g (1 1/2 lb) leeks, washed and sliced",
    "1 large onion, finely chopped",
    "1 medium potato, diced small",
    "1 large carrot, diced small",
    "1 knob of butter",
    "1 tablespoon olive oil",
    "1 teaspoon sugar (optional)",
    "1 heaped teaspoon mustard powder",
    "2 teaspoons cornflour",
    "1 vegetable stock cube",
    "30g (1 oz) Gruyere cheese, grated",
    "60g (2 oz) mature Cheddar, grated",
    "1 small carton (225ml) double cream",
    "1.5L (2 1/2 pints) water, or as needed",
    "salt and pepper, to taste"
  ]
},
{
  "id": "Christmas Stollen ",
  "description": "I got this stollen recipe while I was Head Baker at the Dorchester. It's packed with dried fruit and filled with a marzipan surprise. It makes a perfect food gift at Christmas. ",
  "prep_time": "Prep: 2 hours |Cook: 40 min ",
  "preparaion_steps": [
    "In a small bowl, dissolve yeast in warm milk. Let stand until creamy, about 10 minutes.",
    "In a large bowl, combine the yeast mixture with the egg, caster sugar, salt, butter, and 3/4 of the bread flour; beat well. Add the remaining flour, a little at a time, stirring well after each addition.",
    "When the dough has begun to pull together, turn it out onto a lightly floured surface, and knead in the currants, sultanas, dried cherries and mixed peel. Continue kneading until smooth, about 8 minutes.",
    "Lightly oil a large bowl, place the dough in the bowl, and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.",
    "Lightly grease a baking tray. Deflate the dough and turn it out onto a lightly floured surface. Roll the marzipan into a rope and place it in the centre of the dough. Fold the dough over to cover it; pinch the seams together to seal.",
    "Place the loaf, seam side down, on the prepared baking tray. Cover with a clean, damp tea-towel and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 180 C / Gas mark 4.",
    "Bake in the preheated oven for 10 minutes, then reduce heat to 150 C / Gas mark 2 and bake for a further 30 to 40 minutes, or until golden brown.",
    "Allow loaf to cool on a wire cooling rack. Dust the cooled loaf with icing sugar, sprinkle with cinnamon and finish with toasted flaked almonds.",
    " "
  ],
  "ingredients": [
    "2 teaspoons dried active baking yeast",
    "175ml (6 fl oz) warm milk (45 C)",
    "1 large egg",
    "75g (3 oz) caster sugar",
    "1 1/2 teaspoons salt",
    "75g (3 oz) unsalted butter, softened",
    "350g (12 oz) bread flour",
    "50g (2 oz) currants",
    "50g (2 oz) sultanas",
    "50g (2 oz) red glace cherries, quartered",
    "175g (6 oz) diced mixed citrus peel",
    "200g (7 oz) marzipan",
    "1 heaped teaspoon icing sugar",
    "1/2 tsp ground cinnamon",
    "toasted flaked almonds for sprinkling on top"
  ]
},
{
  "id": "Polly's eccles cakes ",
  "description": "Traditional Manchester delicacy! Little individual pastries bursting with currants and spice. Bake up a batch of your own in stead of buying them. They make a great food gift as they will keep for a while in an airtight tin. ",
  "prep_time": "Prep: 30 min |Cook: 15 min ",
  "preparaion_steps": [
    "In a medium saucepan, combine sugar and butter. Cook over medium heat until melted.",
    "Add currants, mixed peel, nutmeg and allspice. Continue to cook until heated through. Remove from heat and allow to cool.",
    "Preheat oven to 220 C / Gas mark 7.",
    "On a lightly floured surface, roll out pastry and cut into 4 inch rounds.",
    "Place a small spoonful of filling onto centre of each pastry circle, draw the edges together over the fruit and pinch to seal. Turn over, then press gently with a rolling pin.",
    "Make a small hole or 2 small slash marks in the centre of each pastry bun. Brush with beaten egg white, and sprinkle with sugar. Arrange on baking tray.",
    "Bake in preheated oven for 15 minutes, or until lightly browned around edges."
  ],
  "ingredients": [
    "450g (1 lb) ready-made puff pastry",
    "60g (2 oz) caster sugar",
    "30g (1 oz) butter",
    "120g (4 oz) currants",
    "30g (1 oz) chopped mixed peel",
    "1/2 teaspoon each of nutmeg and allspice",
    "1 egg white, beaten",
    "2 tablespoons caster sugar for sprinkling"
  ]
},
{
  "id": "Braised beef in red wine ",
  "description": "A rich and tasty dish that is good enough for a dinner party, yet easy enough for an informal supper. Can easily adapt for a slow cooker and the flavours will improve if cooked in advance. ",
  "prep_time": "Prep: 20 min |Cook: 3 hours 30 min ",
  "preparaion_steps": [
    "Coat the meat in the flour and fry in the oil for approx 5 minutes until brown. Set aside in a large casserole dish.",
    "Fry the shallots in oil for 3-5 minutes, adding the crushed garlic for the last 2 minutes. Add this to the beef along with the mushrooms.",
    "Warm the wine till bubbling and add to the casserole.",
    "Add ketchup, bouquet garni, beef stock cube and bacon to the casserole and mix together.",
    "Cover and put in oven at 170 C / Gas 3 for approximately 2 1/2 hours, remove lid and cook for a further 1/2 hour. Alternately put in slow cooker on low for 6-8 hours."
  ],
  "ingredients": [
    "900g (2 lb) braising or stewing beef, cubed",
    "seasoned flour",
    "olive oil",
    "450g (1 lb) shallots",
    "4 large garlic cloves, crushed",
    "450g (1 lb) mushrooms, quartered",
    "1 bottle of red wine",
    "4 rashers of smoked bacon, chopped",
    "3 tablespoons tomato ketchup",
    "1 bouquet garni",
    "1 beef stock cube"
  ]
},
{
  "id": "Moist garlic roasted chicken ",
  "description": "Chicken wrapped in greaseproof paper to trap all the wonderful juices - keeps beautifully moist! ",
  "prep_time": "Prep: 10 min ",
  "preparaion_steps": [
    "Preheat oven to 160 degrees C / gas mark 3.",
    "Place a large sheet of greaseproof or baking parchment into the middle of a roasting tray. It should be large enough to wrap around the chicken plus plenty of extra for folding over.",
    "Season the chicken with salt and pepper, stuff with half of the lemon slices and place breast side up in the middle of the paper. Sprinkle garlic slices and thyme sprigs evenly over the chicken. Lay the remaining lemon slices over the breast. Fold the paper over the chicken forming a loose parcel.",
    "Bake in the preheated oven until the chicken has cooked, about 1 1/2 to 2 hours or until the juices are no longer pink.",
    "Perfect Prawn Pitta Wrap ",
    "hese perfect prawn pittas are delicious with the perfect tangy sauce (very similar to marie rose), watercress and avocado! I love prawn sandwiches but this is a great twist on the ordinary sandwich. ",
    "Ingredients ",
    "Serves: 1 ",
    "1 pitta bread",
    "2 tablespoons mayonnaise",
    "1 teaspoon ketchup",
    "drop of horseradish sauce",
    "sprinkle of cayenne pepper",
    "splash of lemon juice",
    "1 small avacado",
    "60g (2 oz) cooked, peeled prawns",
    "small handful of watercress",
    "Place pitta bread in toaster and leave until it puffs out. Cut off end of pitta bread and stick a knife inside to open up the pocket.",
    "In a bowl place the mayonnaise, ketchup, horseradish, cayenne pepper and a splash of lemon juice. Combine.",
    "Chop up avacado and add to sauce along with prawns.",
    "Rip up some watercress and add to the bowl.",
    "Combine and spoon the mixture into the the pitta bread!"
  ],
  "ingredients": [
    "1 whole (1.8kg) chicken",
    "salt and freshly ground black pepper",
    "1 large lemon, sliced",
    "6 cloves garlic, sliced",
    "6 sprigs fresh thyme"
  ]
},
{
  "id": "Cheese and bacon stuffed pasta shells ",
  "description": "A family favourite! Great served with a crisp green salad and garlic bread. ",
  "prep_time": "Prep: 30 min |Cook: 30 min ",
  "preparaion_steps": [
    "Preheat the oven to 200 degrees C (Gas Mark 6). Cook the pasta shells in boiling water for 8 minutes, or as directed. Drain and cool.",
    "In a frying pan, heat olive oil and fry chopped bacon, onion and garlic for about 5 minutes.",
    "Pour passata into a large, shallow casserole dish and stir in rosemary. Mix together breadcrumbs, soft cheese, parsley and the bacon mixture; season with pepper. Spoon the bacon and breadcrumb mixture equally into the pasta shells. Sit the shells tightly together on top of the passata. Tear the mozzarella into pieces and scatter over the pasta shells.",
    "Bake in the preheated oven until the cheese has melted and started to brown, about 30 minutes."
  ],
  "ingredients": [
    "200g (7 oz) (conchiglioni rigati (large pasta shells)",
    "1 tbsp olive oil",
    "4 rashers of smoked bacon, roughly chopped",
    "1 small onion, chopped",
    "1 clove garlic, crushed",
    "50g (2 oz) crusty white bread, whizzed in a food processor to make crumbs",
    "240g (9 oz) soft cheese",
    "4 tbsp roughly chopped fresh parsley",
    "1 tsp chopped fresh rosemary",
    "700g (1 lb 9 oz) jar of tomato passata (sieved tomatoes)",
    "1 (150g /5 oz) ball of buffalo mozzarella cheese, drained"
  ]
},
{
  "id": "Tofu vindaloo ",
  "description": "This is an easy vegetarian tofu vindaloo. Serve with basmati rice. ",
  "prep_time": "Prep: 20 min |Cook: 20 min ",
  "preparaion_steps": [
    "Heat oil in a large heavy pot on medium-high heat. Cook ginger and allow to become aeromatic, about 2 minutes.",
    "Add onions, cauliflower and carrots, cook until lightly braised, about 5 minutes.",
    "Mix tomato puree and vindaloo spice into coconut milk. Add coconut milk mixutre to the vegetables, stir. Add remaining ingredients, stir gently.",
    "Bring to the boil then cook at a simmer over medium heat until vegetables are cooked but not overdone, about 15 minutes. Serve over basmati rice or other grain."
  ],
  "ingredients": [
    "450g extra firm tofu, cut into 2.5cm cubes",
    "1/2 head cauliflower, separated into florets",
    "3 medium carrots, peeled and sliced",
    "2 onions, halved and sliced",
    "200g mushrooms, sliced",
    "5cm piece of ginger, peeled and finely chopped",
    "1 (400g) tin chickpeas, rinsed",
    "1 (400g) tin coconut milk",
    "6 tablespoons tomato puree",
    "225ml vegetable stock",
    "3 tablespoons good quality Vindaloo paste",
    "3 tablespoons vegetable oil",
    "salt to taste"
  ]
}
]






